### Introduction

## Relational databases
Relational databases store data in tables with fields (columns) and records (rows), and we can query data and make calculations based on these records.

## SQL magic
Project Jupyter facilitates magic commands that are designed to solve some of the common problems in standard data analysis - these commands are prefixed by the `%` character for `line magic` and a double `%%` prefix for `cell magic`, which operate on multiple lines of input.

The IPython SQL magic extension allows us to write SQL queries into code cells, as well as write these results directly into Pandas DataFrames, which provide fast, flexible, and expressive data structures designed to make working with `relational` or `labeled` data both easy and intuituve, and is arguably the most powerful and flexible open source data analysis / manipulation tool available.

### What is the SQL?
SQL, or Structured Query Language, is a language designed to allow both technical and non-technical users query, manipulate, and transform, and transform data from a relational database. And due to its simplicity, SQL databases provide safe and scalable storage for millions of websites and mobile applications.

Did you know?  
There are many popular SQL databases including SQLite, MySQL, Postgres, Oracle and Microsoft SQL Server. All of them support the common SQL language standard, which is what this site will be teaching, but each implementation can differ in the additional features and storage types it supports.

In [1]:
# !pip install ipython-sql
# conda install -c conda-forge ipython-sql

In [2]:
import sqlite3
import sqlalchemy

In [3]:
# To load the SQL module - ipython-sql extension - into the notebook
%load_ext sql

In [4]:
%sql sqlite://

'Connected: @None'

## Lesson 1: SELECT queries 101

- create a SQLite database
- create a data table
- insert data into the table
- query data from the table

`SELECT` statement, which are often colloquially refered to as *quaries*.

Example of table SQL:
```Python
%%sql
CREATE TABLE sales
(
    key       varchar(6),
    ts        timestamp,
    product   integer,
    completed boolean,
    price     float
);
INSERT INTO sales
VALUES ('sale_1', '2019-11-08 00:00', 0, TRUE, 1.1),
       ('sale_2', '2019-11-08 01:00', 0, FALSE, 1.2),
       ('sale_3', '2019-11-08 01:00', 0, TRUE, 1.3),
       ('sale_4', '2019-11-08 01:00', 1, FALSE, 1.4),
       ('sale_5', '2019-11-08 02:00', 1, TRUE, 1.5),
       ('sale_6', '2019-11-08 02:00', 1, TRUE, 1.5);
```

In [52]:
# !pip install mysql-connector-python-rf

In [130]:
import mysql.connector

config = {
  'user': 'root',
  'password': 'root',
  'host': 'localhost',
  'database': 'learning_sql_database',
  'raise_on_warnings': True,
}

link = mysql.connector.connect(**config, buffered=True)

In [136]:
mycursor =  link.cursor()
mycursor.execute(
"""CREATE TABLE writer
(
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,
    USERID int NOT NULL UNIQUE,
    PRIMARY KEY (USERID))"""
)

In [134]:
# REPLACE ? INSERT
# MySQL при вставке новой записи в поле с первичным ключом (нет структуры таблицы) которое я думаю имеет тип INT 
# по умолчанию записывается 0 и потому MySQL не допускает вторичного значения по ключевому полю.

mycursor =  link.cursor()
sql = "REPLACE INTO writer (FirstName, LastName, USERID) VALUES (%s, %s, %s)"
val = [
  ('Peter', 'Lowstreet', 4),
  ('Amy', 'Apple st', 652),
  ('Hannah', 'Mountain', 21),
  ('Michael', 'Valley', 345),
  ('Sandy', 'Ocean blvd', 999),
  ('Betty', 'Green Grass', 1),
  ('Richard', 'Sky st', 331),
  ('Susan', 'One way', 98),
  ('Vicky', 'Yellow Garden', 2),
  ('Ben', 'Park Lane', 38),
  ('William', 'Central st', 954),
  ('Chuck', 'Main Road', 989),
  ('Viola', 'Sideway', 1633)
]

mycursor.executemany(sql, val)
link.commit()
print(mycursor.rowcount, "record was inserted.")

25 record was inserted.

In [56]:
import pandas as pd

In [135]:
pd.read_sql_query('SELECT * FROM writer', link)

   FirstName       LastName  USERID
0      Betty    Green Grass       1
1      Vicky  Yellow Garden       2
2      Peter      Lowstreet       4
3     Hannah       Mountain      21
4        Ben      Park Lane      38
5      Susan        One way      98
6    Richard         Sky st     331
7    Michael         Valley     345
8        Amy       Apple st     652
9    William     Central st     954
10     Chuck      Main Road     989
11     Sandy     Ocean blvd     999
12     Viola        Sideway    1633

In [50]:
link.close()